# Predicting CTC of new employees

In [138]:
#importing libraries
import pandas as pd
import numpy as np

In [139]:
#reading the dataset
Hires = pd.read_csv('Hires.csv')

## Data Exploration

In [140]:
Hires.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,Tier 1,Manager,Non-Metro,55523,3,66,19,71406.58
1,2,Tier 2,Executive,Metro,57081,1,84,18,68005.87
2,3,Tier 2,Executive,Metro,60347,2,52,28,76764.02
3,4,Tier 3,Executive,Metro,49010,2,81,33,82092.39
4,5,Tier 3,Executive,Metro,57879,4,74,32,73878.10

In [141]:
Hires.shape

(1338, 9)

In [142]:
Hires.College.value_counts()

Tier 1    649
Tier 2    364
Tier 3    325
Name: College, dtype: int64

In [143]:
Hires.Role.value_counts()

Executive    1064
Manager       274
Name: Role, dtype: int64

In [144]:
Hires['City type'].value_counts()

Metro        676
Non-Metro    662
Name: City type, dtype: int64

In [145]:
Hires.describe()

,S.No.,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
count,1338.000000,1338.000000,1338.000000,1338.000000,1338.000000,1338.000000
mean,669.500000,55581.762332,2.525411,59.890882,39.207025,75459.339036
std,386.391641,6685.600553,1.123502,14.894696,14.049960,12551.280147
min,1.000000,36990.000000,1.000000,35.000000,18.000000,53020.320000
25%,335.250000,50547.000000,2.000000,47.000000,27.000000,66905.067500
50%,669.500000,55293.500000,3.000000,60.000000,39.000000,73112.640000
75%,1003.750000,60150.500000,4.000000,73.000000,51.000000,80747.175000
max,1338.000000,77911.000000,4.000000,85.000000,64.000000,123416.990000

In [146]:
Hires.isna().sum()

S.No.                   0
College                 0
Role                    0
City type               0
Previous CTC            0
Previous job changes    0
Graduation marks        0
Exp (Months)            0
CTC                     0
dtype: int64

In [147]:
Hires = Hires.drop(['S.No.'] , axis = 1)

In [148]:
Hires

,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,Tier 1,Manager,Non-Metro,55523,3,66,19,71406.58
1,Tier 2,Executive,Metro,57081,1,84,18,68005.87
2,Tier 2,Executive,Metro,60347,2,52,28,76764.02
3,Tier 3,Executive,Metro,49010,2,81,33,82092.39
4,Tier 3,Executive,Metro,57879,4,74,32,73878.10
...,...,...,...,...,...,...,...,...
1333,Tier 3,Executive,Metro,59661,4,68,50,69712.40
1334,Tier 1,Executive,Non-Metro,53714,1,67,18,69298.75
1335,Tier 2,Executive,Non-Metro,61957,1,47,18,66397.77
1336,Tier 1,Executive,Non-Metro,53203,3,69,21,64044.38
1337,Tier 3,Manager,Non-Metro,51820,1,47,61,83346.06

In [149]:
# Transform categorical variables to the numerical variables
CollegeD = pd.get_dummies(Hires.College , prefix = 'colleges').iloc[:, :2]
RoleD = pd.get_dummies(Hires.Role , prefix = 'roles').iloc[:, 1:]
CityT = pd.get_dummies(Hires['City type'] , prefix = 'citytype').iloc[:, 0:1]

In [150]:
Hires =pd.concat([Hires , CollegeD , RoleD , CityT] , axis = 1)

In [151]:
Hires

,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,colleges_Tier 1,colleges_Tier 2,roles_Manager,citytype_Metro
0,Tier 1,Manager,Non-Metro,55523,3,66,19,71406.58,1,0,1,0
1,Tier 2,Executive,Metro,57081,1,84,18,68005.87,0,1,0,1
2,Tier 2,Executive,Metro,60347,2,52,28,76764.02,0,1,0,1
3,Tier 3,Executive,Metro,49010,2,81,33,82092.39,0,0,0,1
4,Tier 3,Executive,Metro,57879,4,74,32,73878.10,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
1333,Tier 3,Executive,Metro,59661,4,68,50,69712.40,0,0,0,1
1334,Tier 1,Executive,Non-Metro,53714,1,67,18,69298.75,1,0,0,0
1335,Tier 2,Executive,Non-Metro,61957,1,47,18,66397.77,0,1,0,0
1336,Tier 1,Executive,Non-Metro,53203,3,69,21,64044.38,1,0,0,0
1337,Tier 3,Manager,Non-Metro,51820,1,47,61,83346.06,0,0,1,0

In [152]:
Hires = Hires.drop(['College' , 'Role' , 'City type'] , axis = 1)

In [153]:
Hires.head()

,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC,colleges_Tier 1,colleges_Tier 2,roles_Manager,citytype_Metro
0,55523,3,66,19,71406.58,1,0,1,0
1,57081,1,84,18,68005.87,0,1,0,1
2,60347,2,52,28,76764.02,0,1,0,1
3,49010,2,81,33,82092.39,0,0,0,1
4,57879,4,74,32,73878.10,0,0,0,1

In [154]:
# rearranging columns
columnsTitles = ['colleges_Tier 1' , 'colleges_Tier 2' , 'roles_Manager' ,'citytype_Metro' , 'Previous CTC' , 'Previous job changes' , 'Graduation marks' , 'Exp (Months)' , 'CTC']

Hires = Hires.reindex(columns=columnsTitles)

In [155]:
Hires = Hires.astype(float)

In [156]:
Hires.dtypes

colleges_Tier 1         float64
colleges_Tier 2         float64
roles_Manager           float64
citytype_Metro          float64
Previous CTC            float64
Previous job changes    float64
Graduation marks        float64
Exp (Months)            float64
CTC                     float64
dtype: object

In [157]:
X = Hires.drop('CTC' , axis = 1)
y = Hires['CTC']

## Applying Linear Regression Model

In [188]:
# splitting training and testing data in 70:30 ratio
from sklearn.model_selection import train_test_split
train_X  , test_X , train_y , test_y = train_test_split(X, y, test_size = 0.3 , random_state = 2)

In [159]:
# using linear regression model
from sklearn.linear_model import LinearRegression
reg = LinearRegression().fit(train_X, train_y)

In [160]:
# regression score
reg.score(test_X, test_y)

0.6372176223093018

In [161]:
reg.score(train_X, train_y)

0.5915885948488417

In [162]:
test_data_prediction = reg.predict(test_X)

In [163]:
test_data_prediction

array([ 71347.32613176,  73480.76949211,  79633.53461659,  63874.7858195 ,
        71449.44149352,  70619.51186143,  64080.05645792,  66253.9738497 ,
        70027.64089918,  68910.15193052,  71500.5565045 ,  64965.72913258,
        82739.5365174 ,  62345.17006338,  76232.43897453,  73527.9562203 ,
        72413.78877105,  67186.48536473,  85148.66537248,  67775.32876438,
        69853.46057956,  67430.05262246,  94402.12467304,  89969.42662847,
        88072.80894425,  74576.2418352 ,  63903.01810646,  77836.00379858,
        72203.01445207,  59399.85876326,  69263.46519975,  63103.43228617,
        68174.51507882,  65368.24833646,  68234.74760572,  64853.2831886 ,
        87833.09771776,  77033.85179737,  88947.731099  ,  76358.19380403,
        56969.52106914,  92562.56906471,  65428.35990372,  66666.10141943,
        70109.25853791,  70935.71789937,  72595.62698124,  74277.34314119,
        75136.38239588,  81913.36564817,  73328.71257266,  68355.0354054 ,
        81446.40819232,  94021.26009622,  71660.39044822,  80677.73056652,
        68253.9336761 ,  73185.33920822,  65561.29887066,  93476.42674999,
        72729.58343285,  67930.14363617,  62471.62037665,  94219.12536624,
        64942.06269917,  82015.43857389,  83503.96072826,  64735.08287493,
        70334.68481026,  71242.89900771,  75725.50209117,  74356.17694959,
        72773.67216126,  73723.83605173,  82997.48616154,  78435.92928285,
        69237.23489623,  69013.98073275,  70085.25397998,  71558.9105911 ,
        77270.45066494,  79163.45090429,  75654.44401   ,  87476.37159412,
        77176.67254783,  63693.25850032,  97694.61976059,  73496.51509309,
        75978.57653257,  75038.32664227,  73968.68238117,  85432.78429638,
        66937.22672414,  77939.78663407,  69787.35881313,  84279.40720237,
        63099.2648745 ,  72237.51293638,  64177.60666556,  85862.61699746,
        69540.97684937,  66567.29618024,  63905.92205217,  77651.01709751,
        69927.17711873,  77335.32458614,  71766.56192875,  63908.67407295,
        79179.79870105,  91717.2513334 ,  61742.31626145,  76489.24832777,
        87579.24596083,  78842.92411204,  67788.44260659,  67735.7028983 ,
        74309.67518168,  69183.42023501,  77158.99894828,  89448.29368883,
        73065.01831914,  68227.43970686,  77422.71057504,  79864.92868374,
        68095.82368608,  85018.50537137,  91167.61766379,  73528.66366207,
        64191.68642053,  69939.7534954 ,  67342.61304663,  71968.8016258 ,
        70035.00956613,  64497.71617019,  64035.09978295,  71729.58398296,
        69758.89364912,  90170.68552709,  94595.15082745,  66431.56513614,
        93464.64994479,  61773.55268126,  67209.39484218,  76524.8362596 ,
        76569.39262525,  89030.4621329 ,  74961.30466661,  74055.6606826 ,
        67370.21361648,  69590.91824378,  68527.59642495,  68273.98234413,
        63448.93358705,  80976.83167278,  76978.15547605,  73941.51893367,
        72728.42482271,  90460.48100836,  59860.40357417,  74710.82500576,
        82204.28722019,  75729.66671201,  75384.06214328,  63792.07211239,
        64258.20682375,  66850.0689548 ,  80697.7042411 ,  91504.03792445,
        82137.58031783,  67888.96296938,  92732.12242315,  79579.3081769 ,
        90510.03956709,  91000.00334903,  76276.32680754,  72547.19894527,
        69521.40881477,  65779.91294487,  76453.44266042,  72256.38387758,
        65156.68972421,  65182.57770115,  85578.54469299,  68527.66643624,
        72052.85208775,  84048.67102394,  77351.53777341,  60687.21509757,
        68746.31100763,  93753.94212031,  67363.68494305,  63413.75218774,
        69535.98088583,  82990.35467701,  73563.85640095,  99044.89432178,
       102737.90025794,  76499.03263734,  83135.67466747,  82112.8763039 ,
        93660.34412177,  69728.99921554,  67930.77367113,  61931.08203401,
        73761.82149394,  76202.45432801,  70761.1740545 ,  95526.54901303,
        81437.50532397,  67283.05929351,  68598.95516883,  88199.81523877,
        66801.79550441,  72372.83516611,  69612.3072419 ,  75013.7109015 ,
        91820.53647137,  66793.85894986,  63672.91724474,  70218.09725462,
        99745.51670953,  71675.9789887 ,  94861.42654564,  88305.76380256,
        73521.75828484,  81590.14441444,  79590.51538394,  65776.9636773 ,
        72210.91524756,  70905.21919585,  73948.29160565,  68582.6468439 ,
        71483.90790863,  66637.72282247,  85085.36862959,  86056.5277235 ,
        83571.152122  ,  74590.72965246,  69845.00329509,  64790.43231296,
        73151.45041783,  70331.01650898,  74048.60357423,  69511.03778747,
        92555.10291806,  89111.23634924,  65253.95665021,  79187.0318422 ,
        76131.10288238,  68286.47116844,  77496.09324647,  67299.22731133,
        68622.14116342,  77920.10430276,  80623.66986171,  65110.66252981,
        74171.36396378,  69000.43173943,  63617.78176627,  71013.84975704,
        88762.9940319 ,  88225.6054709 ,  96362.91243749,  62678.3944449 ,
        85842.74092568,  89435.01131508,  76447.43873609,  88646.89402652,
        62735.36641298,  69112.17179013,  76679.23927085,  66552.30623518,
        68390.7433137 ,  98562.03378622,  72011.40472086,  78252.48143874,
        70662.01482129,  93381.85705577,  76980.04837985,  88571.8652252 ,
        58780.29988184,  70448.03951863,  64504.90889364,  67350.48971935,
        99847.54793   ,  86398.91863901,  88872.22173688,  68353.89833081,
        75740.14429448,  86052.27673904,  69313.64238104,  67756.1979618 ,
        77616.20134117,  77097.51313805,  67560.60822627,  60461.68339344,
        72070.10454828,  66761.94689525,  68954.56205716,  72944.77338482,
        65320.92292595,  71919.69419038,  88148.1012078 ,  67995.83971502,
        71449.82204061,  73014.57533862,  73814.58236665,  73399.30769712,
        97362.3895786 ,  67478.34629709,  79134.58177253,  74766.11789986,
        69025.07292801,  64989.65347487,  79191.79551257,  77707.96439012,
        73939.80169826,  83664.35178845,  73453.86064986,  77341.83753426,
        73940.06117158,  91405.71928237,  77476.23984981,  63362.32024247,
        63167.64673696,  75251.07798246,  71278.35589672,  76139.56966766,
        69090.09991529,  67005.5928492 ,  78153.20564627,  86017.14522626,
        65625.72321471,  79647.80311477,  73309.98167587,  66520.04159155,
        83921.39283882,  87575.67255614,  79026.20238845,  65786.96833686,
        77010.97430231,  92055.47036561,  66069.62181664,  76441.98714641,
        91008.77920683,  78565.51453656,  70337.64172065,  95916.2070811 ,
        76808.68419845,  70542.65528203,  66975.84683684,  71439.57927911,
        64742.43760398,  71245.66873076,  63751.01122017,  71430.86768433,
        74718.18013742,  68610.45000918,  96563.78237528,  71962.2688965 ,
        86091.43168368,  79190.88700416,  74709.01367218,  73441.41737703,
       104729.2201411 ,  75065.27252169,  92606.27450421,  80917.60788213,
        60616.72537321,  96183.86017432,  65585.00674771,  71132.51662641,
        76836.40960048,  78058.08576343,  93921.00013588,  76856.08645435,
        66913.26114654, 104337.580074  ,  62301.52588901,  84330.9081926 ,
        69054.484293  ,  88886.45768071,  69281.9139229 ,  81482.3983538 ,
        74022.06023293,  67091.13132497,  94991.94810219,  77696.07793809,
        64994.53746015,  73495.1882206 ,  74833.98651841,  74861.6040543 ,
        66285.80691525, 101495.9983306 ,  70088.18777948,  72903.23325992,
        72601.23792837,  65897.60079042,  70080.29507525,  97390.9915193 ,
        90104.93513994,  68281.97011994])

In [164]:
# Using R2 score to know how well the model performed
from sklearn import metrics
score = metrics.r2_score(test_y, test_data_prediction)
print("R2 score : ", score)

R2 score :  0.6372176223093018

In [165]:
test = pd.read_csv('testhires.csv')

In [166]:
test.head()

,College,Role,City type,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC,Predicted CTC
0,Tier 1,Manager,Non-Metro,1,0,1,0,55523,3,66,19,71406.57653,NaN
1,Tier 2,Executive,Metro,0,1,0,1,57081,1,84,18,68005.87063,NaN
2,Tier 2,Executive,Metro,0,1,0,1,60347,2,52,28,76764.02028,NaN
3,Tier 3,Executive,Metro,0,0,0,1,49010,2,81,33,82092.38688,NaN
4,Tier 3,Executive,Metro,0,0,0,1,57879,4,74,32,73878.09773,NaN

In [167]:
y1 = test['Actual CTC']

In [168]:
test.drop(['College' , 'Role' , 'City type' , 'Predicted CTC' , 'Actual CTC'] , axis = 1, inplace = True)

In [169]:
test.dtypes

College_T1              int64
College_T2              int64
Role_Manager            int64
City_Metro              int64
previous CTC            int64
previous job changes    int64
Graduation marks        int64
Exp                     int64
dtype: object

In [170]:
test = test.astype(float)

In [171]:
test.dtypes

College_T1              float64
College_T2              float64
Role_Manager            float64
City_Metro              float64
previous CTC            float64
previous job changes    float64
Graduation marks        float64
Exp                     float64
dtype: object

In [172]:
test.head()

,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp
0,1.0,0.0,1.0,0.0,55523.0,3.0,66.0,19.0
1,0.0,1.0,0.0,1.0,57081.0,1.0,84.0,18.0
2,0.0,1.0,0.0,1.0,60347.0,2.0,52.0,28.0
3,0.0,0.0,0.0,1.0,49010.0,2.0,81.0,33.0
4,0.0,0.0,0.0,1.0,57879.0,4.0,74.0,32.0

In [173]:
predict_test = reg.predict(test)
print('Target on test data', predict_test)

Target on test data [86017.14522626 67039.47075481 70905.21919585 ... 65151.79406742
 66666.10141943 89435.01131508]

In [174]:
test1 = test

In [175]:
test1.head()

,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp
0,1.0,0.0,1.0,0.0,55523.0,3.0,66.0,19.0
1,0.0,1.0,0.0,1.0,57081.0,1.0,84.0,18.0
2,0.0,1.0,0.0,1.0,60347.0,2.0,52.0,28.0
3,0.0,0.0,0.0,1.0,49010.0,2.0,81.0,33.0
4,0.0,0.0,0.0,1.0,57879.0,4.0,74.0,32.0

In [104]:
test['Predicted']=predict_test.tolist()

In [105]:
test.Predicted

0       86017.145226
1       67039.470755
2       70905.219196
3       66793.030601
4       70452.864882
            ...
1333    75543.522619
1334    66332.825128
1335    65151.794067
1336    66666.101419
1337    89435.011315
Name: Predicted, Length: 1338, dtype: float64

In [106]:
y1

0       71406.57653
1       68005.87063
2       76764.02028
3       82092.38688
4       73878.09773
           ...
1333    69712.40366
1334    69298.75010
1335    66397.77069
1336    64044.38295
1337    83346.06096
Name: Actual CTC, Length: 1338, dtype: float64

In [107]:
from sklearn import metrics
error_score = metrics.r2_score(y1, test.Predicted)
print("R2 score : ", error_score)

R2 score :  0.606556073591544

In [108]:
test.Predicted

0       86017.145226
1       67039.470755
2       70905.219196
3       66793.030601
4       70452.864882
            ...
1333    75543.522619
1334    66332.825128
1335    65151.794067
1336    66666.101419
1337    89435.011315
Name: Predicted, Length: 1338, dtype: float64

In [123]:
# mean squared error on test data
error_score = metrics.mean_squared_error(y1, test.Predicted)
print(error_score)

61934722.170763135

In [124]:
# root mean squared error
np.sqrt(error_score)

7869.86163606217

## Random Forest Regressor

In [176]:
# using Random Forest Regressor
from sklearn.ensemble import RandomForestRegressor

In [177]:
regressor = RandomForestRegressor(n_estimators=100)

In [178]:
regressor.fit(train_X, train_y)

RandomForestRegressor()

In [179]:
test_data_prediction = regressor.predict(test_X)

In [180]:
test_data_prediction

array([ 71431.1521,  77046.7994,  85378.8489,  66679.6268,  72316.8603,
        68271.6446,  66694.481 ,  69094.9419,  73042.3968,  68037.7882,
        72074.5304,  61966.0494,  76039.9676,  65276.1878,  77516.7108,
        70356.1927,  71869.0082,  64169.2757,  73923.0415,  72503.3442,
        73099.4945,  72244.9224,  96992.0884,  84168.137 ,  98385.8609,
        81915.1319,  62522.3737,  71683.411 ,  75220.4646,  60290.711 ,
        66049.3128,  64532.3198,  66376.6428,  66409.2583,  73530.1534,
        63145.8077,  96221.022 ,  75345.3473,  77272.5344,  73351.9565,
        62407.0863,  89455.7928,  73856.3457,  69146.1548,  69865.0783,
        73315.5796,  72422.1144,  71830.0532,  71941.443 ,  79260.5724,
        75153.4265,  72970.5429,  89507.8237,  93661.7774,  71032.1311,
        76745.5953,  74180.3764,  72168.1393,  66421.8214,  96433.2772,
        78916.3292,  72366.9223,  64991.867 ,  96745.8103,  71907.6625,
        80207.5332,  83087.9984,  62926.4427,  74996.4111,  69393.0846,
        83086.6538,  74876.6857,  71808.754 ,  72050.468 ,  82518.2976,
        77125.3656,  66322.8289,  62290.5982,  64427.1641,  72818.8753,
        76477.4704,  79247.6541,  67660.4272,  75527.7447,  74394.2077,
        62966.942 , 108268.0812,  72646.477 ,  80867.8975,  70255.346 ,
        76786.4933,  83039.9256,  72559.253 ,  74388.4612,  75304.6581,
        83942.7415,  64094.4296,  68243.3902,  65409.3326,  76579.9675,
        70300.3034,  61905.878 ,  64015.7156,  84524.2187,  67786.7281,
        86229.9294,  72878.8261,  69515.3778,  80444.9609,  83955.2091,
        63647.8869,  77501.9412,  78004.7812,  77259.7253,  67960.2421,
        74181.9875,  73728.7327,  66345.3624,  76830.779 ,  99755.9586,
        74350.0133,  69940.4066,  71185.2145,  79388.622 ,  67405.3362,
        75525.6476,  82322.1311,  76951.9562,  67770.3965,  68677.9955,
        68271.3581,  68808.632 ,  73898.7286,  66035.5482,  63631.5644,
        74639.0714,  68846.9881, 101563.5021, 103834.9706,  65705.1548,
        99246.7652,  63898.1533,  64517.1189,  74187.7576,  74423.1398,
        95799.7524,  72456.3743,  69271.9962,  69028.7326,  69964.2776,
        67234.8857,  64261.1491,  61986.9016,  80081.4412,  75838.7573,
        74146.3208,  71351.8776,  85144.5471,  59366.0809,  76729.0992,
        78566.5925,  74369.0973,  74539.3287,  71358.1656,  63159.8194,
        66432.3875,  87410.9197,  77798.1805,  78212.3106,  61162.5144,
       104956.3021,  76080.3393,  97359.3283,  81812.7454,  76250.9649,
        75141.1827,  73190.6897,  67088.5438,  77889.9701,  72691.7958,
        64777.9115,  66940.2566,  74954.617 ,  66146.2722,  67190.8729,
        85376.6792,  77838.2028,  65167.229 ,  62709.806 , 101979.3207,
        71685.0894,  63043.8492,  67144.3513,  71865.5785,  73231.5661,
       107495.867 , 103957.4165,  79410.1533,  74988.4942,  81765.2956,
       105485.4839,  70926.6601,  66678.4851,  63958.6765,  76691.4327,
        73922.3493,  73505.542 , 108876.605 ,  83702.0018,  69905.9207,
        70990.0456,  87308.5491,  67526.3761,  66866.2504,  76543.742 ,
        78657.2706,  88011.5611,  70391.4009,  62858.8703,  70783.023 ,
       108163.3453,  72143.4416, 103889.2928,  78697.8832,  75182.6816,
        75279.4392,  78703.929 ,  72167.8909,  69491.2628,  63504.8942,
        76302.6038,  74005.7574,  70398.5635,  66763.2278,  77496.5956,
       102706.6418,  78448.4161,  73564.7841,  75195.0217,  63239.9763,
        73446.8486,  72077.5803,  75826.3829,  71751.1389,  92946.7813,
        81633.282 ,  68509.2096,  73098.8344,  71197.0807,  69635.4832,
        74196.0851,  70048.927 ,  69288.7393,  80346.4286,  79523.2858,
        68205.3439,  76215.7979,  66782.334 ,  74518.3818,  73069.1597,
        99953.0646,  94252.2059, 103547.1919,  65495.0631,  79610.2349,
        86418.727 ,  70902.7218,  80585.2847,  64090.8944,  68182.5675,
        75864.7822,  66907.3211,  67049.1997, 104893.2207,  71987.7506,
        77338.7357,  65814.23  , 101084.3913,  75455.8423,  98085.0818,
        64886.6837,  65203.8304,  66026.9759,  65304.5125, 106338.256 ,
        92365.6319,  81917.1641,  68323.3366,  71314.6681,  82809.3741,
        68932.6316,  64667.3424,  83536.1452,  78238.6082,  66499.8678,
        59158.9157,  67285.3314,  67075.4854,  71847.9898,  76410.9583,
        66228.3653,  76884.2566,  81168.6111,  65824.7982,  69756.6229,
        68600.4611,  77402.6098,  73655.9786, 106717.4776,  66119.7979,
        79568.1898,  72323.4168,  70157.902 ,  63919.6895,  70982.4628,
        74434.1083,  68768.6486,  81670.6121,  74182.7717,  73174.5523,
        69274.6791,  89733.6837,  72645.0883,  62169.7054,  65923.6483,
        72384.6643,  74415.8465,  73324.9688,  70656.7623,  63849.1287,
        79145.2711,  92302.0836,  64807.0825,  77650.9017,  74480.8161,
        66608.4029,  97052.1428,  94133.9166,  80293.648 ,  68986.988 ,
        77718.8   ,  82021.9979,  67560.5677,  73789.0979,  96042.8983,
        83262.6531,  64886.6841, 101454.2885,  75031.7377,  73222.9174,
        66754.4481,  65790.9288,  63596.8358,  72231.6672,  65292.9608,
        75818.2611,  73639.7615,  65060.1965,  96327.3569,  72106.0202,
        81169.8449,  74550.8905,  68344.1035,  69689.3671, 108695.4387,
        75154.7245,  87150.5564,  80145.3219,  59488.829 , 101749.1853,
        77615.1245,  78168.1736,  71086.2428,  69727.209 , 106770.5046,
        72442.2582,  66660.9346, 108733.184 ,  65195.7778,  81727.9342,
        72476.5536,  90185.2421,  69466.9067,  80699.8625,  78667.9013,
        67361.0931, 102796.8526,  78582.1097,  68101.4004,  74519.2867,
        75077.5222,  76578.7639,  67894.7824, 107698.5119,  66009.9619,
        75164.6127,  77175.645 ,  65569.9505,  71178.4742, 107164.2735,
        93546.6937,  65536.1669])

In [181]:
error_score = metrics.r2_score(test_y, test_data_prediction)
print("R2 : ", error_score)

R2 :  0.6683803584207583

In [182]:
predict_test = regressor.predict(test1)
print('Target on test data', predict_test)

Target on test data [92302.0836 65262.8576 63504.8942 ... 63673.8028 69146.1548 86418.727 ]

In [183]:
test1['Predicted1']=predict_test.tolist()

In [184]:
test1.Predicted1

0       92302.0836
1       65262.8576
2       63504.8942
3       75021.2365
4       70842.0334
           ...
1333    69591.6333
1334    69017.0207
1335    63673.8028
1336    69146.1548
1337    86418.7270
Name: Predicted1, Length: 1338, dtype: float64

In [185]:
error_score = metrics.mean_squared_error(y1, test.Predicted1)
print(error_score)

23256311.21483684

In [186]:
np.sqrt(error_score)

4822.479778582471

In [187]:
r2_score = metrics.r2_score(y1, test.Predicted1)
print(r2_score)

0.8522629297841303

In [189]:
Adj_r2 = 1-(1-r2_score)*(1338-1)/(1338-8-1)

In [190]:
Adj_r2

0.8513736170966006